<a href="https://colab.research.google.com/github/sadullahmath/Exercise/blob/master/Titanic3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('https://raw.githubusercontent.com/PacktWorkshops/The-Supervised-Learning-Workshop/master/Chapter01/Datasets/titanic.csv')

In [0]:
del df['Unnamed: 0']
embarked_grouped= df.groupby('Embarked')

In [4]:
embarked_grouped.agg( lambda x : x.values[0])

         Cabin     Fare  Pclass     Ticket  ...  Parch     Sex  SibSp Survived
Embarked                                    ...
C          C85  71.2833       1   PC 17599  ...      0  female      1      1.0
Q          NaN   8.4583       3     330877  ...      0    male      0      0.0
S          NaN   7.2500       3  A/5 21171  ...      0    male      1      0.0

[3 rows x 10 columns]

In [5]:
embarked_grouped.agg( [lambda x : x.values[0], np.mean, np.std])

               Fare                        ...   Survived
         <lambda_0>       mean        std  ... <lambda_0>      mean       std
Embarked                                   ...
C           71.2833  62.336267  84.185996  ...        1.0  0.553571  0.498608
Q            8.4583  12.409012  13.616133  ...        0.0  0.389610  0.490860
S            7.2500  27.418824  37.096402  ...        0.0  0.336957  0.473037

[3 rows x 18 columns]

In [6]:
embarked_grouped.agg({
    'Fare': np.sum,
    'Age': lambda x: x.values[0]
})

                Fare   Age
Embarked
C         16830.7922  38.0
Q          1526.3085   NaN
S         25033.3862  22.0

In [7]:
age_embarked_grouped = df.groupby(['Sex', 'Embarked'])
age_embarked_grouped.groups

{('female',
  'C'): Int64Index([   1,    9,   19,   31,   39,   43,   52,  111,  114,  128,
             ...
             1238, 1241, 1252, 1255, 1259, 1262, 1266, 1288, 1293, 1305],
            dtype='int64', length=113),
 ('female',
  'Q'): Int64Index([  22,   28,   32,   44,   47,   82,  109,  156,  186,  198,  208,
              241,  264,  274,  289,  300,  303,  322,  330,  358,  359,  368,
              412,  501,  502,  573,  593,  612,  653,  654,  657,  680,  697,
              727,  767,  885,  897,  954,  957,  961,  970,  977,  979, 1002,
             1004, 1018, 1051, 1091, 1097, 1107, 1118, 1164, 1173, 1182, 1195,
             1204, 1206, 1299, 1301, 1302],
            dtype='int64'),
 ('female',
  'S'): Int64Index([   2,    3,    8,   10,   11,   14,   15,   18,   24,   25,
             ...
             1265, 1267, 1273, 1274, 1276, 1282, 1286, 1291, 1300, 1303],
            dtype='int64', length=291),
 ('female', nan): Int64Index([61, 829], dtype='int64'),
 ('male',
  'C'): Int64Index([  26,   30,   34,   36,   42,   48,   54,   57,   60,   64,
             ...
             1222, 1223, 1228, 1230, 1257, 1260, 1295, 1296, 1298, 1308],
            dtype='int64', length=157),
 ('male',
  'Q'): Int64Index([   5,   16,   46,  116,  126,  143,  171,  188,  196,  214,  245,
              260,  278,  280,  301,  364,  388,  411,  421,  428,  459,  468,
              510,  517,  525,  552,  560,  613,  626,  629,  703,  718,  749,
              768,  776,  778,  787,  790,  825,  828,  890,  891,  893,  907,
              938,  946,  975,  993,  997,  998, 1012, 1015, 1074, 1084, 1124,
             1147, 1162, 1249, 1271, 1272, 1279, 1287, 1290],
            dtype='int64'),
 ('male',
  'S'): Int64Index([   0,    4,    6,    7,   12,   13,   17,   20,   21,   23,
             ...
             1283, 1284, 1285, 1289, 1292, 1294, 1297, 1304, 1306, 1307],
            dtype='int64', length=623)}

In [0]:
complete_data = df.dropna()

In [9]:
len(df)

1309

In [10]:
len(df.dropna())

183

In [11]:
df.aggregate(lambda x: x.isna().sum() )

Cabin       1014
Embarked       2
Fare           1
Pclass         0
Ticket         0
Age          263
Name           0
Parch          0
Sex            0
SibSp          0
Survived     418
dtype: int64

In [0]:
df_valid = df.loc[(~df.Embarked.isna()) & (~df.Fare.isna())]

In [13]:
df_valid[['Age']] = df_valid[['Age']].fillna(df_valid.Age.mean())

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

In [14]:
df_valid.loc[df.Pclass == 1, 'Age'].mean()

37.956806510097

In [15]:
df_valid.loc[df.Pclass == 2, 'Age'].mean()

29.52440879717284

In [16]:
df_valid.loc[df.Pclass == 3, 'Age'].mean()

26.233963387880507

In [17]:
for name, grp in df_valid.groupby(['Pclass', 'Sex']):
    print('%i' % name[0], name[1], '%0.2f' % grp['Age'].mean())

1 female 36.30
1 male 39.27
2 female 27.56
2 male 30.74
3 female 24.45
3 male 27.02

In [18]:
mean_ages = df_valid.groupby(['Pclass', 'Sex'])['Age'].\
    transform(lambda x: x.fillna(x.mean()))
df_valid.loc[:, 'Age'] = mean_ages

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [0]:
mean_ages = df_valid.groupby(['Pclass', 'Sex'])['Age'].\
    transform(lambda x: x.fillna(x.mean()))

In [20]:
df_valid.loc[:, 'Age'] = mean_ages

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [21]:
len(df.loc[df.Survived ==1])

342

In [22]:
len(df.loc[df.Survived ==0])

549

In [0]:
df_oversample = df.append(df.iloc[0])